{
    "modelTopology": {
      "class_name": "Sequential",
      "config": {
        "name": "sequential",
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [null, 30, 1662],
              "dtype": "float32",
              "sparse": false,
              "name": "lstm_input"
            }
          },
          {
            "class_name": "LSTM",
            "config": {
              "name": "lstm",
              "trainable": true,
              "batch_input_shape": [null, 30, 1662],
              "dtype": "float32",
              "units": 64,
              "activation": "relu",
              "recurrent_activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "recurrent_initializer": {
                "class_name": "Orthogonal",
                "config": {
                  "gain": 1,
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {
  
                }
              },
              "unit_forget_bias": true,
              "kernel_regularizer": null,
              "recurrent_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "recurrent_constraint": null,
              "bias_constraint": null,
              "dropout": 0,
              "recurrent_dropout": 0,
              "implementation": 2,
              "return_sequences": true,
              "return_state": false,
              "go_backwards": false,
              "stateful": false,
              "unroll": false
            }
          },
          {
            "class_name": "LSTM",
            "config": {
              "name": "lstm_1",
              "trainable": true,
              "units": 128,
              "activation": "relu",
              "recurrent_activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "recurrent_initializer": {
                "class_name": "Orthogonal",
                "config": {
                  "gain": 1,
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {
  
                }
              },
              "unit_forget_bias": true,
              "kernel_regularizer": null,
              "recurrent_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "recurrent_constraint": null,
              "bias_constraint": null,
              "dropout": 0,
              "recurrent_dropout": 0,
              "implementation": 2,
              "return_sequences": true,
              "return_state": false,
              "go_backwards": false,
              "stateful": false,
              "unroll": false
            }
          },
          {
            "class_name": "LSTM",
            "config": {
              "name": "lstm_2",
              "trainable": true,
              "units": 64,
              "activation": "relu",
              "recurrent_activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "recurrent_initializer": {
                "class_name": "Orthogonal",
                "config": {
                  "gain": 1,
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {
  
                }
              },
              "unit_forget_bias": true,
              "kernel_regularizer": null,
              "recurrent_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "recurrent_constraint": null,
              "bias_constraint": null,
              "dropout": 0,
              "recurrent_dropout": 0,
              "implementation": 2,
              "return_sequences": false,
              "return_state": false,
              "go_backwards": false,
              "stateful": false,
              "unroll": false
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "units": 64,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {
  
                }
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null,
              "name": "dense",
              "trainable": true
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "units": 32,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {
  
                }
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null,
              "name": "dense_1",
              "trainable": true
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "units": 11,
              "activation": "softmax",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {
  
                }
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null,
              "name": "dense_2",
              "trainable": true
            }
          }
        ]
      },
      "keras_version": "tfjs-layers 4.20.0",
      "backend": "tensor_flow.js"
    },
    "format": "layers-model",
    "generatedBy": "TensorFlow.js tfjs-layers v4.20.0",
    "convertedBy": null,
    "weightsManifest": [
      {
        "paths": [
          "tfjs_files%2Fgroup1-shard1of1.bin"
        ],
        "weights": [
          {
            "name": "lstm/kernel",
            "shape": [1662, 256],
            "dtype": "float32"
          },
          {
            "name": "lstm/recurrent_kernel",
            "shape": [64, 256],
            "dtype": "float32"
          },
          {
            "name": "lstm/bias",
            "shape": [256],
            "dtype": "float32"
          },
          {
            "name": "lstm_1/kernel",
            "shape": [64, 512],
            "dtype": "float32"
          },
          {
            "name": "lstm_1/recurrent_kernel",
            "shape": [128, 512],
            "dtype": "float32"
          },
          {
            "name": "lstm_1/bias",
            "shape": [512],
            "dtype": "float32"
          },
          {
            "name": "lstm_2/kernel",
            "shape": [128, 256],
            "dtype": "float32"
          },
          {
            "name": "lstm_2/recurrent_kernel",
            "shape": [64, 256],
            "dtype": "float32"
          },
          {
            "name": "lstm_2/bias",
            "shape": [256],
            "dtype": "float32"
          },
          {
            "name": "dense/kernel",
            "shape": [64, 64],
            "dtype": "float32"
          },
          {
            "name": "dense/bias",
            "shape": [64],
            "dtype": "float32"
          },
          {
            "name": "dense_1/kernel",
            "shape": [64, 32],
            "dtype": "float32"
          },
          {
            "name": "dense_1/bias",
            "shape": [32],
            "dtype": "float32"
          },
          {
            "name": "dense_2/kernel",
            "shape": [32, 11],
            "dtype": "float32"
          },
          {
            "name": "dense_2/bias",
            "shape": [11],
            "dtype": "float32"
          }
        ]
      }
    ]
  }